<!-- dflook/terraform-github-actions {"workspace":"verify","backend":"07e578a84baefd85251a6f5f8c6cdba06dcd9dddad586a7fedecb62b2964b811","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","plan_job_ref":"Job Test plan target and replace #255 at https://github.com/dflook/terraform-github-actions/actions/runs/3253215683","plan_hash":"de8205bef06c1e5890061808e9e6e61cf986277e8df867d5b724d9c3a77d7bd7","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __verify__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
  + resource "random_string" "foreach" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + foreach = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #255](https://github.com/dflook/terraform-github-actions/actions/runs/3253215683)